In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("titanic.csv")

In [34]:
df.shape

(891, 12)

In [36]:
df.shape

(183, 12)

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df1=df[['Pclass','Sex','Age','Fare','Survived']]

In [5]:
df1.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [37]:
df1.shape

(891, 5)

In [38]:
df1=df1.dropna()

In [39]:
df1.shape

(714, 5)

In [40]:
x=df1[['Pclass','Sex','Age','Fare']]
x.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [41]:
y=df1['Survived']
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [42]:
from sklearn.preprocessing import LabelEncoder

In [43]:
label_sex=LabelEncoder()

In [44]:
x['Sex_label']=label_sex.fit_transform(x['Sex'])

In [45]:
x.head()

   Pclass     Sex   Age     Fare  Sex_label
0       3    male  22.0   7.2500          1
1       1  female  38.0  71.2833          0
2       3  female  26.0   7.9250          0
3       1  female  35.0  53.1000          0
4       3    male  35.0   8.0500          1

In [46]:
x=x.drop('Sex',axis='columns')

In [90]:
x.head()

   Pclass   Age     Fare  Sex_label
0       3  22.0   7.2500          1
1       1  38.0  71.2833          0
2       3  26.0   7.9250          0
3       1  35.0  53.1000          0
4       3  35.0   8.0500          1

In [47]:
from sklearn.model_selection import train_test_split

In [83]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2)

In [84]:
len(x_train)

571

In [85]:
len(y_test)

143

In [86]:
from sklearn import tree

In [87]:
tr=tree.DecisionTreeClassifier()

In [88]:
tr.fit(x_train,y_train)

DecisionTreeClassifier()

In [89]:
tr.score(x_test,y_test)

0.7762237762237763

In [91]:
tr.predict([[3,23,8,1]])

array([0], dtype=int64)

In [95]:
tr.predict([[2,23,12,0]])

array([1], dtype=int64)